# Projeto Técnicas de programação I

## Análise exploratória de dados/Pandas

Nomes: Paulo Roberto P. Alves

Turma: 892

Nesse projeto trabalharemos com dados fictícios de investidores.

Informações

Cadastro:
- **id** : Identificação do investidor
- **Nome** : Nome completo do investidor 
- **Sexo** : Feminino ou masculino
- **Nasc** : Data de nascimento
- **Idade** : Idade do investidor 
- **Email** : E-mail do investidor
- **Lat_long** : Dados geográficos do investidor
- **Job** : Profisão do investidor ou do seu responsável (em inglês)
- **Estado** : Estado onde o investidor reside

Investimento:
- **id** : Identificação do investidor
- **Salario** : Renda do investidor ou seu responsável
- **Perfil** : Perfil de investimento
- **Ativo01, Ativo02, Ativo03, Ativo04, Ativo05, Ativo06, Ativo07** : O quanto de dinheiro o investidor colocou em cada ativo
- **Nota1, Nota2** : O quanto o investidor está satisfeito com nossa empresa (2 avaliações)

Lembrando que esses dados são irreais e fictícios

### Critérios de avaliação

Os seguintes itens serão avaliados:

1. Reprodutibilidade do código: seu código será executado e precisa gerar os mesmos resultados apresentados por você;

2. Clareza: seu código precisa ser claro e deve existir uma linha de raciocínio direta. Comente o código em pontos que julgar necessário para o entendimento total;

3. Explicação de todos os processos feitos e decisões tomadas

## 1 - Carregar os arquivos e cadastro, investimento1 e investimento2 e mostrar a quantidade de linhas de cada um, além das informações desses dataframes

In [8]:
import pandas as pd
import datetime as dt

###Verificando Informações sobre o arquivo Cadastro

In [9]:
#verificando quantidade de linhas do arquivo Cadastro
df_cadastro = pd.read_csv('cadastro.csv')
print(f'Quantidade de linhas do arquivo Cadastro: {df_cadastro.shape[0]}')

Quantidade de linhas do arquivo Cadastro: 38754

In [10]:
#verificando o tipo de informações do arquivo cadastro
print('Tipo de informações - Arquivo Cadastro: \n')
print(df_cadastro.dtypes)

Tipo de informações - Arquivo Cadastro:

id          object
Nome        object
Sexo        object
Nasc        object
Idade        int64
Email       object
Lat_long    object
Job         object
Estado      object
dtype: object

In [11]:
df_cadastro.head(2)

,id,Nome,Sexo,Nasc,Idade,Email,Lat_long,Job,Estado
0,id0000001,Eunice Hellen do Vale,Fem,1970-11-12,51,djones@yahoo.com,"(Decimal('24.7024355'), Decimal('-28.038258'))",Technical author,TO
1,id0000002,Sebastião Castelo Branco Júnior,Masc,2019-12-10,2,barnesandrea@yahoo.com,"(Decimal('21.8589875'), Decimal('122.830566'))","Biochemist, clinical",DF

###Verificando informações sobre o arquivo investimento_parte1

In [12]:
#Verificando quantidade de linhas do arquivo investimentos parte 1 
df_investimento1 = pd.read_csv('investimento_parte1.csv')
print(f'Quantidade de linhas do arquivo investimento parte 1: {df_investimento1.shape[0]}')

Quantidade de linhas do arquivo investimento parte 1: 20000

In [13]:
#verificando o tipo de informações do arquivo investimento parte1
print('Tipo de informações - Arquivo investimento_parte1: \n')
print(df_investimento1.dtypes)

Tipo de informações - Arquivo investimento_parte1:

id          object
Salario     object
Perfil      object
Ativo01    float64
Ativo02    float64
Ativo03    float64
Ativo04    float64
Ativo05    float64
Ativo06    float64
Ativo07    float64
Nota1      float64
Nota2      float64
dtype: object

In [14]:
df_investimento1

,id,Salario,Perfil,Ativo01,Ativo02,Ativo03,Ativo04,Ativo05,Ativo06,Ativo07,Nota1,Nota2
0,id0011529,$2.25,Agressivo,1311.38,NaN,NaN,29267.48,4993.30,NaN,506.40,73.007216,30.025005
1,id0030644,$24.57,Agressivo,1007.38,4846.66,2717.82,12532.15,4282.98,NaN,499.93,20.000123,29.477728
2,id0019311,$367.53,Moderado,1128.99,4668.94,3092.60,9777.77,4246.30,2007.83,509.50,24.901450,49.659852
3,id0036705,$23.26,Moderado,1185.26,4782.17,2669.05,14047.87,6026.84,2064.09,489.82,14.246718,29.271206
4,id0001368,$6.31,Conservador,957.64,5585.52,NaN,5067.08,4030.51,2022.61,507.39,5.922253,11.840601
...,...,...,...,...,...,...,...,...,...,...,...,...
19995,id0027243,$334.62,Conservador,1406.60,5314.55,3166.72,22356.01,4993.03,NaN,508.21,NaN,81.009106
19996,id0027322,$281.18,Agressivo,857.37,6045.98,3052.01,11084.71,4678.42,NaN,506.94,48.641983,NaN
19997,id0037205,$464.70,Agressivo,NaN,NaN,3655.41,13124.58,5579.33,2188.45,511.30,74.618662,80.220031
19998,id0010187,$940.72,Conservador,1416.94,4772.79,3049.52,21053.61,6532.92,NaN,486.77,2.464077,55.905051
19999,id0009375,$56.39,Moderado,812.14,5461.14,3455.45,28370.73,4468.04,NaN,509.97,8.931671,49.578415

###Verificando o arquivo investimento_parte2

In [15]:
#Verificando quantidade de linhas do arquivo investimentos parte 2
df_investimento2 = pd.read_csv('investimento_parte2.csv')
print(f'Quantidade de linhas do arquivo investimento parte 2: {df_investimento2.shape[0]}')

Quantidade de linhas do arquivo investimento parte 2: 24052

In [16]:
#verificando o tipo de informações do arquivo investimento parte2
print('Tipo de informações - Arquivo investimento_parte2: \n')
print(df_investimento2.dtypes)

Tipo de informações - Arquivo investimento_parte2:

id          object
Salario     object
Perfil      object
Ativo01    float64
Ativo02    float64
Ativo03    float64
Ativo04    float64
Ativo05    float64
Ativo06    float64
Ativo07    float64
Nota1      float64
Nota2      float64
dtype: object

In [17]:
df_investimento2

,id,Salario,Perfil,Ativo01,Ativo02,Ativo03,Ativo04,Ativo05,Ativo06,Ativo07,Nota1,Nota2
0,id0000859,$51483.81,Agressivo,1273.95,5080.37,3565.44,NaN,5635.72,NaN,513.38,47.599278,7.057028
1,id0022202,$457.43,Conservador,1121.09,4927.51,3911.58,5511.70,5593.40,NaN,497.28,37.353757,61.516665
2,id0002056,$93245.46,Moderado,NaN,5283.71,2914.76,NaN,4707.33,NaN,499.06,98.895407,45.197866
3,id0005674,$3044.00,Agressivo,1353.76,5827.28,2998.24,16341.70,4712.65,2007.44,515.10,50.658089,65.660735
4,id0004777,$880.30,Agressivo,NaN,5695.77,3525.98,NaN,4147.29,NaN,506.77,72.993882,55.530580
...,...,...,...,...,...,...,...,...,...,...,...,...
24047,id0018222,$615.87,Conservador,933.65,5741.80,4031.59,6336.84,NaN,NaN,486.19,NaN,34.151046
24048,id0005515,$212.76,Conservador,1624.80,NaN,2689.68,21886.01,4571.79,NaN,497.47,93.032164,93.621515
24049,id0009893,$9.32,Agressivo,829.20,NaN,3831.45,NaN,4784.34,2143.79,485.33,3.120521,9.086454
24050,id0016100,$81796.74,Conservador,1587.47,4881.66,4352.03,10391.18,4695.44,2465.65,492.84,95.665966,30.164927
24051,id0027880,$38480.37,Agressivo,996.90,5604.43,2801.04,9183.62,6220.96,NaN,503.24,55.035639,57.691996

## 2 - Juntar os dataframes de investimento1 e investimento2 em um só e ver a quantidade de linhas

In [18]:
#juntando os dataframes
df_investimento_total = df_investimento1.append(df_investimento2,ignore_index = True)
df_investimento_total

C:\Users\paulo\AppData\Local\Temp\ipykernel_21000\287080442.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_investimento_total = df_investimento1.append(df_investimento2,ignore_index = True)

,id,Salario,Perfil,Ativo01,Ativo02,Ativo03,Ativo04,Ativo05,Ativo06,Ativo07,Nota1,Nota2
0,id0011529,$2.25,Agressivo,1311.38,NaN,NaN,29267.48,4993.30,NaN,506.40,73.007216,30.025005
1,id0030644,$24.57,Agressivo,1007.38,4846.66,2717.82,12532.15,4282.98,NaN,499.93,20.000123,29.477728
2,id0019311,$367.53,Moderado,1128.99,4668.94,3092.60,9777.77,4246.30,2007.83,509.50,24.901450,49.659852
3,id0036705,$23.26,Moderado,1185.26,4782.17,2669.05,14047.87,6026.84,2064.09,489.82,14.246718,29.271206
4,id0001368,$6.31,Conservador,957.64,5585.52,NaN,5067.08,4030.51,2022.61,507.39,5.922253,11.840601
...,...,...,...,...,...,...,...,...,...,...,...,...
44047,id0018222,$615.87,Conservador,933.65,5741.80,4031.59,6336.84,NaN,NaN,486.19,NaN,34.151046
44048,id0005515,$212.76,Conservador,1624.80,NaN,2689.68,21886.01,4571.79,NaN,497.47,93.032164,93.621515
44049,id0009893,$9.32,Agressivo,829.20,NaN,3831.45,NaN,4784.34,2143.79,485.33,3.120521,9.086454
44050,id0016100,$81796.74,Conservador,1587.47,4881.66,4352.03,10391.18,4695.44,2465.65,492.84,95.665966,30.164927
44051,id0027880,$38480.37,Agressivo,996.90,5604.43,2801.04,9183.62,6220.96,NaN,503.24,55.035639,57.691996

In [19]:
#verificando valores repetidos
df_investimento_total.id.value_counts()

id0006135    2
id0027340    2
id0036408    2
id0038299    2
id0032261    2
            ..
id0013431    1
id0001498    1
id0026743    1
id0027752    1
id0027880    1
Name: id, Length: 38754, dtype: int64

In [20]:
#analisando se os valores realmente são iguais
repetido = df_investimento_total[df_investimento_total.id=='id0032261']
repetido

,id,Salario,Perfil,Ativo01,Ativo02,Ativo03,Ativo04,Ativo05,Ativo06,Ativo07,Nota1,Nota2
6825,id0032261,$36676.41,Agressivo,1254.65,5282.98,2841.62,8320.75,5095.01,NaN,516.02,68.811447,21.352064
20775,id0032261,$36676.41,Agressivo,1254.65,5282.98,2841.62,8320.75,5095.01,NaN,516.02,68.811447,21.352064

## 3 - Crie um novo dataframe eliminando as linhas duplicadas

In [21]:
#Dropando linhas duplicadas
df_investimento_total_sem_duplicadas = df_investimento_total.drop_duplicates(ignore_index=True)
df_investimento_total_sem_duplicadas

,id,Salario,Perfil,Ativo01,Ativo02,Ativo03,Ativo04,Ativo05,Ativo06,Ativo07,Nota1,Nota2
0,id0011529,$2.25,Agressivo,1311.38,NaN,NaN,29267.48,4993.30,NaN,506.40,73.007216,30.025005
1,id0030644,$24.57,Agressivo,1007.38,4846.66,2717.82,12532.15,4282.98,NaN,499.93,20.000123,29.477728
2,id0019311,$367.53,Moderado,1128.99,4668.94,3092.60,9777.77,4246.30,2007.83,509.50,24.901450,49.659852
3,id0036705,$23.26,Moderado,1185.26,4782.17,2669.05,14047.87,6026.84,2064.09,489.82,14.246718,29.271206
4,id0001368,$6.31,Conservador,957.64,5585.52,NaN,5067.08,4030.51,2022.61,507.39,5.922253,11.840601
...,...,...,...,...,...,...,...,...,...,...,...,...
38749,id0012328,$86268.66,Moderado,804.92,4520.13,3388.55,18396.16,NaN,NaN,504.90,97.685833,70.195608
38750,id0005515,$212.76,Conservador,1624.80,NaN,2689.68,21886.01,4571.79,NaN,497.47,93.032164,93.621515
38751,id0009893,$9.32,Agressivo,829.20,NaN,3831.45,NaN,4784.34,2143.79,485.33,3.120521,9.086454
38752,id0016100,$81796.74,Conservador,1587.47,4881.66,4352.03,10391.18,4695.44,2465.65,492.84,95.665966,30.164927
38753,id0027880,$38480.37,Agressivo,996.90,5604.43,2801.04,9183.62,6220.96,NaN,503.24,55.035639,57.691996

## 4 - Junte o dataframe de investimento com o de cadastro
Dica: use a chave id

In [22]:
#Juntando o dataFrame Cadastro com o de Ivenstimento_total_sem_duplicadas 
#usando Merge outer e chave 'id'

df_cadastro_investimento = df_cadastro.merge(df_investimento_total_sem_duplicadas, how='outer', on='id')
df_cadastro_investimento.head(2)

,id,Nome,Sexo,Nasc,Idade,Email,Lat_long,Job,Estado,Salario,Perfil,Ativo01,Ativo02,Ativo03,Ativo04,Ativo05,Ativo06,Ativo07,Nota1,Nota2
0,id0000001,Eunice Hellen do Vale,Fem,1970-11-12,51,djones@yahoo.com,"(Decimal('24.7024355'), Decimal('-28.038258'))",Technical author,TO,$63.67,Moderado,1174.27,4980.98,2638.24,NaN,4480.91,2329.72,480.72,79.600372,9.802620
1,id0000002,Sebastião Castelo Branco Júnior,Masc,2019-12-10,2,barnesandrea@yahoo.com,"(Decimal('21.8589875'), Decimal('122.830566'))","Biochemist, clinical",DF,$21.96,Moderado,842.12,5646.09,3336.07,NaN,5624.22,2669.98,504.17,44.406893,90.512871

## 5 - Ordene o dataframe pelo id, de forma crescente e redefina o índice

In [23]:
#primeiro colocando o id como indice e depois ordenando pelo indice
df_por_id = df_cadastro_investimento.set_index('id').sort_values('id')
#resetando o indice
df = df_por_id.reset_index() 
df

,id,Nome,Sexo,Nasc,Idade,Email,Lat_long,Job,Estado,Salario,Perfil,Ativo01,Ativo02,Ativo03,Ativo04,Ativo05,Ativo06,Ativo07,Nota1,Nota2
0,id0000001,Eunice Hellen do Vale,Fem,1970-11-12,51,djones@yahoo.com,"(Decimal('24.7024355'), Decimal('-28.038258'))",Technical author,TO,$63.67,Moderado,1174.27,4980.98,2638.24,NaN,4480.91,2329.72,480.72,79.600372,9.802620
1,id0000002,Sebastião Castelo Branco Júnior,Masc,2019-12-10,2,barnesandrea@yahoo.com,"(Decimal('21.8589875'), Decimal('122.830566'))","Biochemist, clinical",DF,$21.96,Moderado,842.12,5646.09,3336.07,NaN,5624.22,2669.98,504.17,44.406893,90.512871
2,id0000003,Romildo Fábio de Carvalho,Masc,2015-12-28,6,walkermichael@yahoo.com,"(Decimal('-28.2161525'), Decimal('97.140529'))","Development worker, international aid",DF,$62497.64,Agressivo,818.81,5516.52,3396.64,NaN,5033.83,2229.45,523.12,44.020024,65.060941
3,id0000004,Lana Albina de Lemos Mumy,Fem,1993-05-03,28,cobbangela@hotmail.com,"(Decimal('-40.8557635'), Decimal('-2.936099'))",Estate manager/land agent,DF,$99878.74,Agressivo,NaN,5258.69,3723.10,NaN,5933.91,NaN,486.05,25.597924,86.548918
4,id0000005,Rose Elisângela Vyrnium de Moura,Fem,1984-06-10,37,crawfordcraig@yahoo.com,"(Decimal('-20.2620885'), Decimal('104.349223'))",Chartered public finance accountant,MS,$188.01,Conservador,1505.16,6415.30,3462.67,30841.35,6044.86,2198.89,512.98,14.463307,33.566292
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
38749,id0038750,Beatriz Maísa de Miranda Milani,Fem,1999-02-20,22,mark47@gmail.com,"(Decimal('-23.8494875'), Decimal('-91.561304'))",Further education lecturer,RS,$4993.49,Moderado,1001.01,5561.55,NaN,8454.99,NaN,2191.78,489.76,66.644257,6.462871
38750,id0038751,Juan dos Santos,Masc,1999-07-10,22,greggnguyen@hotmail.com,"(Decimal('-7.8876355'), Decimal('155.835880'))",Adult guidance worker,PI,$41218.63,Moderado,1532.51,5102.84,3097.50,11243.08,4692.11,2368.93,496.02,96.987294,72.333030
38751,id0038752,Severino Edson de Viana Loase,Masc,1981-12-01,40,cindy11@yahoo.com,"(Decimal('-52.1338005'), Decimal('-59.715325'))",Arts development officer,PR,$32.41,Agressivo,1163.90,4911.63,3746.62,NaN,6733.79,2338.43,504.32,32.139610,22.742974
38752,id0038753,Kim Mooshi,Masc,1999-12-06,22,mcdonaldmario@gmail.com,"(Decimal('-81.2874995'), Decimal('-28.805800'))",Production manager,RJ,$914.52,Conservador,NaN,5532.35,2861.32,NaN,4921.77,2024.00,500.65,98.385080,56.611838
38753,id0038754,Vinícius Arnaldo de Pereira Mendes,Masc,2003-09-13,18,omartinez@hotmail.com,"(Decimal('-37.248521'), Decimal('6.033254'))",Pension scheme manager,AL,$29076.19,Moderado,981.62,4825.10,NaN,18085.88,5161.07,2257.66,507.95,29.660050,47.371606

## 6 - Faça uma análise dos dados faltantes e trate-os

Mostre todas as colunas com dados faltantes, sua quantidade/porcentagem e como tratar (preencher) cada uma delas explicando sua estratégia

In [24]:
#1) verificando se existem dados faltantes
df.isnull().sum()

id              0
Nome            0
Sexo            0
Nasc            0
Idade           0
Email           0
Lat_long        0
Job             0
Estado          0
Salario         0
Perfil          0
Ativo01      9724
Ativo02      6100
Ativo03      6169
Ativo04     11887
Ativo05      6191
Ativo06     19514
Ativo07         0
Nota1        3000
Nota2        2000
dtype: int64

In [25]:
#2) observado que as colunas de ativos possuem dados faltantes
#o que é justificado pois o cliente pode escolher qual ativo deseja
# então nesse caso onde não houver alocação de recurso substituiremos por zero.

df = df.copy()
#aqui estou alterando cada item NaN nas colunas Ativos para 0.
df[['Ativo01','Ativo02','Ativo03','Ativo04','Ativo05','Ativo06','Ativo07']] = df[['Ativo01','Ativo02','Ativo03','Ativo04','Ativo05','Ativo06','Ativo07']].fillna(0)
#tratando os NaN das colunas notas 1 e 2 (trocar por media)
df[['Nota1','Nota2']] = df[['Nota1','Nota2']].fillna(df[['Nota1','Nota2']].mean())
#conferindo resultado
df.isnull().sum()

id          0
Nome        0
Sexo        0
Nasc        0
Idade       0
Email       0
Lat_long    0
Job         0
Estado      0
Salario     0
Perfil      0
Ativo01     0
Ativo02     0
Ativo03     0
Ativo04     0
Ativo05     0
Ativo06     0
Ativo07     0
Nota1       0
Nota2       0
dtype: int64

In [26]:
#3) alterando tipos de dados, mas antes vamos fazer um dtypes
df.dtypes

id           object
Nome         object
Sexo         object
Nasc         object
Idade         int64
Email        object
Lat_long     object
Job          object
Estado       object
Salario      object
Perfil       object
Ativo01     float64
Ativo02     float64
Ativo03     float64
Ativo04     float64
Ativo05     float64
Ativo06     float64
Ativo07     float64
Nota1       float64
Nota2       float64
dtype: object

## 7 - Manipule os dados a seguir:

In [27]:
#nasc pode mudar de string para datetime
df['Nasc'] = pd.to_datetime(df['Nasc'])

- Mudar o nome da coluna "Salário" para "Renda" e tratar a coluna (sem caracter $ e tipo numérica)

In [28]:
#trocar o nome da coluna salário para Renda
df = df.rename(columns={'Salario':'Renda'})

In [29]:
#tirar o $
df['Renda'] = df['Renda'].str.replace('$','')
df['Renda'].head(3)

C:\Users\paulo\AppData\Local\Temp\ipykernel_21000\1835674501.py:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df['Renda'] = df['Renda'].str.replace('$','')

0       63.67
1       21.96
2    62497.64
Name: Renda, dtype: object

In [30]:
#transformar em float
df['Renda'] = df['Renda'].astype('float')
df.dtypes

id                  object
Nome                object
Sexo                object
Nasc        datetime64[ns]
Idade                int64
Email               object
Lat_long            object
Job                 object
Estado              object
Renda              float64
Perfil              object
Ativo01            float64
Ativo02            float64
Ativo03            float64
Ativo04            float64
Ativo05            float64
Ativo06            float64
Ativo07            float64
Nota1              float64
Nota2              float64
dtype: object

- Criar coluna "Total" somando o valor de todos os ativos por investidor

In [31]:
df['Total'] = df['Ativo01']+df['Ativo02']+df['Ativo03']+df['Ativo04']+df['Ativo05']+df['Ativo06']+df['Ativo07']
df['Total'].head(3)

0    16084.84
1    18622.65
2    17518.37
Name: Total, dtype: float64

- Criar coluna "Media" com a média das notas 1 e 2

In [32]:
df['Media'] = (df['Nota1']+df['Nota2'])/2
df['Media'].head(3)

0    44.701496
1    67.459882
2    54.540483
Name: Media, dtype: float64

- Criar coluna "Dominio" com apenas o domínio do email (dica: separar por @)

In [33]:
df['Dominio'] = [i[1] for i in df['Email'].str.split('@')]
df['Dominio'].head(3)

0    yahoo.com
1    yahoo.com
2    yahoo.com
Name: Dominio, dtype: object


- Mudar os dados da coluna "Sexo" para Masculino e Feminino (tente usar o map)

In [34]:
#Função para trocar o termo conforme solicitado
def trocar_termo(termo):
  if termo == 'Fem':
    return f'Feminino'
  elif termo == 'Masc':
    return f'Masculino'

In [35]:
#usando map para a troca
df['Sexo'] = list(map(trocar_termo,df['Sexo']))

- Transformar os dados da coluna Media em inteiro

In [36]:
df['Media'] = df['Media'].astype('int')

- Criar coluna "NPS" onde o investidor é promotor se a média das notas é maior igual a 80, neutro se a média estiver entre 50 e 80, e detrator se for abaixo de 50

In [37]:
#função para classificar o investidor
def classifica_investidor(media):
  if media >=80:
    return f'Promotor'
  elif media >= 50 and media < 80:
    return f'Neutro'
  else:
    return f'Detrator'

In [38]:
#criar a coluna NPS (promotor - media>=80, neutro - 50<=media<80, detrator-media<50)

#usando map para preencher a coluna NPS 
df['NPS'] = list(map(classifica_investidor,df['Media']))

df.head(3)

,id,Nome,Sexo,Nasc,Idade,Email,Lat_long,Job,Estado,Renda,...,Ativo04,Ativo05,Ativo06,Ativo07,Nota1,Nota2,Total,Media,Dominio,NPS
0,id0000001,Eunice Hellen do Vale,Feminino,1970-11-12,51,djones@yahoo.com,"(Decimal('24.7024355'), Decimal('-28.038258'))",Technical author,TO,63.67,...,0.0,4480.91,2329.72,480.72,79.600372,9.802620,16084.84,44,yahoo.com,Detrator
1,id0000002,Sebastião Castelo Branco Júnior,Masculino,2019-12-10,2,barnesandrea@yahoo.com,"(Decimal('21.8589875'), Decimal('122.830566'))","Biochemist, clinical",DF,21.96,...,0.0,5624.22,2669.98,504.17,44.406893,90.512871,18622.65,67,yahoo.com,Neutro
2,id0000003,Romildo Fábio de Carvalho,Masculino,2015-12-28,6,walkermichael@yahoo.com,"(Decimal('-28.2161525'), Decimal('97.140529'))","Development worker, international aid",DF,62497.64,...,0.0,5033.83,2229.45,523.12,44.020024,65.060941,17518.37,54,yahoo.com,Neutro

## 8 - Calcule os seguintes dados
- Calcule o total investido em cada coluna Ativo

In [39]:
total_por_ativo = df[['Ativo01','Ativo02','Ativo03','Ativo04','Ativo05','Ativo06','Ativo07']].sum(axis=0)
total_por_ativo.apply(lambda x: f'R$ {x:.2f}')

Ativo01     R$ 32755689.89
Ativo02    R$ 168079806.78
Ativo03    R$ 102330550.86
Ativo04    R$ 407133967.35
Ativo05    R$ 172066821.10
Ativo06     R$ 44626844.36
Ativo07     R$ 19379032.72
dtype: object

- Qual o menor valor investido em cada ativo?

In [40]:
#desconsiderei o valor 0 pois o zero representa que não houve investimento

ativos =['Ativo01','Ativo02','Ativo03','Ativo04','Ativo05','Ativo06','Ativo07']
minimo_por_ativo = df[ativos][df[ativos]>0].min()
minimo_por_ativo.apply(lambda x: f'R$ {x:.2f}')

Ativo01     R$ 800.01
Ativo02    R$ 4500.05
Ativo03    R$ 2500.01
Ativo04    R$ 5000.81
Ativo05    R$ 4000.14
Ativo06    R$ 2000.04
Ativo07     R$ 462.93
dtype: object

- Mostre a média e desvio padrão de cada ativo

In [41]:
ativos =['Ativo01','Ativo02','Ativo03','Ativo04','Ativo05','Ativo06','Ativo07']
media_e_desvPadrao_ativos = df[ativos].agg(['mean','std'])
media_e_desvPadrao_ativos

,Ativo01,Ativo02,Ativo03,Ativo04,Ativo05,Ativo06,Ativo07
mean,845.220878,4337.095701,2640.515840,10505.598580,4439.975773,1151.541631,500.052452
std,524.568525,1909.955896,1204.864694,9084.714705,2068.665605,1172.059182,9.998218

- Qual a idade do investidor mais velho?

In [42]:
idade_maior = df['Idade'].max()
qnt_idade_maior = df[df['Idade']==idade_maior].shape[0]
print(f'A idade dos {qnt_idade_maior} investidores mais velhos é {idade_maior}')

A idade dos 774 investidores mais velhos é 51

- Qual a mediana da coluna Média?

In [43]:
mediana_col_media = df['Media'].describe()['50%']
print(f'A mediana da coluna Média é {mediana_col_media}')

A mediana da coluna Média é 49.0

## 9 - Responder as perguntas abaixo

- Quantos investidores são promotores?

In [44]:
qnt_promotor = df[df['NPS']=='Promotor'].shape[0]
print(f'Temos {qnt_promotor} investidores que são promotores')

Temos 2703 investidores que são promotores

- Quantos investidores são do sexo feminino?

In [45]:
qnt_feminino = df[df['Sexo']=='Feminino'].shape[0]
print(f'Temos {qnt_feminino} investidores que são do sexo feminino')

Temos 19385 investidores que são do sexo feminino

- Quantos investidores investiram mais de 16000 no Ativo04?

In [46]:
ativo04_16k = df[df['Ativo04']>16000].shape[0]
print(f'Temos {ativo04_16k} investidores que investiram mais de R$16.000,00 no ativo04')

Temos 10689 investidores que investiram mais de R$16.000,00 no ativo04

- Quantos investidores investiram mais de 16000 no Ativo04 e menos de 5000 no Ativo05?

In [47]:
masacara_mais16k = df['Ativo04']>16000 
masacara_menos5k = df['Ativo05']<5000
qnt_mais16k_menos5k = df[(masacara_mais16k)&(masacara_menos5k)].shape[0]
qnt_mais16k_menos5k
print(f'Temos {qnt_mais16k_menos5k} investidores que investiram mais de R$16.000,00 no ativo04\
 e menos de R$5.000,00 no ativo05')

Temos 5374 investidores que investiram mais de R$16.000,00 no ativo04 e menos de R$5.000,00 no ativo05

- Quantos investidores do sexo feminino tem mais de 25 anos e investiu menos de 10000? (bonus: por que esse dado seria importante para a estratégia da nossa empresa?

In [48]:
mascara_fem_25 = (df['Idade']>25)&(df['Sexo']=='Feminino')
mascara_menos_10k = df['Total']<10000
qnt_fem25_menos10k = df[(mascara_fem_25)&(mascara_menos_10k)].shape[0]
print(f'Temos {qnt_fem25_menos10k} investidores do sexo feminino com mais de 25 anos \
que investiram menos de R$10.000,00.')
#resposta bonus: 
mascara_fem = df['Sexo']=='Feminino'
media_fem25 = df['Total'][mascara_fem_25].describe()['mean']
print(f'A media de investimento das mulheres com 25 anos é R${media_fem25:.2f} e total de mulheres nessa faixa é 9674.\
\nConsiderando o total de mulheres com 25 anos, estamos falando de aproximadamente 5% na condição de \ninvestimento de menos de R$10.000.\
\nE ao analisar a Renda não foi conclusivo se elas teriam como aumentar o investimento.')

Temos 442 investidores do sexo feminino com mais de 25 anos que investiram menos de R$10.000,00.
A media de investimento das mulheres com 25 anos é R$24334.57 e total de mulheres nessa faixa é 9674.
Considerando o total de mulheres com 25 anos, estamos falando de aproximadamente 5% na condição de
investimento de menos de R$10.000.
E ao analisar a Renda não foi conclusivo se elas teriam como aumentar o investimento.


- Quantos investidores tem em cada estado (dica: use groupby)

In [49]:
qnt_investidores_estado = df.groupby('Estado').size()
qnt_investidores_estado

Estado
AC    1435
AL    1376
AM    1495
AP    1438
BA    1484
CE    1465
DF    1470
ES    1472
GO    1394
MA    1454
MG    1407
MS    1436
MT    1390
PA    1421
PB    1405
PE    1477
PI    1503
PR    1371
RJ    1466
RN    1472
RO    1440
RR    1495
RS    1393
SC    1430
SE    1319
SP    1464
TO    1382
dtype: int64

- Qual é a soma do total investido por cada estado?

In [50]:
total_estado = df.groupby('Estado').Total.sum()
total_estado.apply(lambda x: f'R$ {x:.2f}')

Estado
AC    R$ 35362505.80
AL    R$ 33763479.45
AM    R$ 37036424.81
AP    R$ 34996432.12
BA    R$ 36188507.51
CE    R$ 35959807.36
DF    R$ 36277409.37
ES    R$ 36112618.12
GO    R$ 34234860.26
MA    R$ 34952752.65
MG    R$ 33820223.17
MS    R$ 35279491.41
MT    R$ 34206427.27
PA    R$ 34877463.97
PB    R$ 34248820.05
PE    R$ 35353945.12
PI    R$ 37038930.90
PR    R$ 33002424.19
RJ    R$ 35910946.83
RN    R$ 35755623.32
RO    R$ 34341430.55
RR    R$ 36543504.21
RS    R$ 34300026.29
SC    R$ 35223280.67
SE    R$ 32496697.65
SP    R$ 35624582.45
TO    R$ 33464097.56
Name: Total, dtype: object

- Como os investidores se distribuem em promotores, detratores e neutros?

In [51]:
#para responder primeiro achamos através do groupby a quantidade de investidores
#em cada NPS. 
investidores_total = df.groupby('NPS').size()
#depois dividimos pelo total de investidores
investidores_NPS_total = investidores_total/df.shape[0]
#agora para melhorar a visualização colocamos em percentual
investidores_NPS_total.apply(lambda x: f'{x*100:.2f}%')

NPS
Detrator    50.62%
Neutro      42.41%
Promotor     6.97%
dtype: object

- Qual é a média do total investido por promotores, detratores e neutros?

In [52]:
#usando groupby selecionamos NPS e depois Total e aplicamos a soma ao Total
total_investido_NPS = df.groupby('NPS').Total.sum()
#para melhorar a visualização tiramos da notação científica.
total_investido_NPS.apply(lambda x: f'R$ {x:.2f}')

NPS
Detrator    R$ 478438171.23
Neutro      R$ 401860029.58
Promotor     R$ 66074512.25
Name: Total, dtype: object